<template>
<v-layout>

    <app-single-task xs3 v-for="task in tasks" :key="task.id" :task="task"></app-single-task>

    <!-- <app-task-details xs6></app-task-details> -->

    <router-view></router-view>
</v-layout>
</template>

<script>

import SingleTask from './SingleTask.vue'
import TaskDetails from './TaskDetails.vue'

export default {
  components: {
    'app-single-task': SingleTask,
    'app-task-details': TaskDetails
  },

  data() {
    return {
      tasks: [
        {
          id: 1,
          title: 'Отнести кольцо в Мордор и уничтожить его в Роковой горе',
          description:'Равным образом консультация с широким активом представляет собой интересный эксперимент проверки направлений прогрессивного развития. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании направлений прогрессивного развития. Равным образом укрепление и развитие структуры влечет за собой процесс внедрения и модернизации новых предложений. Таким образом дальнейшее развитие различных форм деятельности требуют от нас анализа направлений прогрессивного развития.',
          assignee: 'Фродо',
          },
          {
          id: 2,
          title: 'Убить дракона',
          description:'С другой стороны дальнейшее развитие различных форм деятельности представляет собой интересный эксперимент проверки форм развития. Равным образом реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации соответствующий условий активиза',
          assignee: 'Джордж',
          },
          {
          id: 3,
          title: 'Купить хлеб',
          description:'Таким образом рамки и место обучения кадров позволяет оценить значение форм развития. Таким образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития. Задача организации, в особенности же новая модель организационной деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений раз',
          assignee: 'Саша',
          },
          // {
          // id: 4,
          // title: 'Новая задача',
          // description:'Таким образом рамки и место обучения кадров позволяет оценить значение форм развития. Таким образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития. Задача организации, в особенности же новая модель организационной деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений раз',
          // assignee: 'Саша',
          // },

      ]
    }
  }

}
</script>

<style>

</style>